# Merging & Concatentaing Data

In [5]:
import pandas as pd

In [31]:
bios = pd.read_csv("./data/bios.csv")
nocs = pd.read_csv("./data/noc_regions.csv")
results = pd.read_csv("./data/results.csv")

In [9]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [10]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [ ]:
bios_new.rename(columns={"region": "born_country_full"}, inplace=True)

In [14]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [17]:
bios_new[bios_new["NOC_x"]!= bios_new["born_country_full"]][["name", "NOC_x", "born_country_full"]]

                       name    NOC_x born_country_full
4              Albert Canet   France                UK
12                J. Defert   France               NaN
13           Étienne Durand   France               NaN
16               Guy Forget   France           Morocco
27       Guy, Baron Lejeune   France               NaN
...                     ...      ...               ...
145491        Matthew Wepke  Jamaica               NaN
145493   Landysh Falyakhova      ROC            Russia
145495    Polina Luchnikova      ROC            Russia
145496  Valeriya Merkusheva      ROC            Russia
145497      Yuliya Smirnova      ROC            Russia

[73210 rows x 3 columns]

In [18]:
ind = bios[bios['born_country'] == 'IND'].copy()
usa = bios[bios['born_country'] == 'USA'].copy()

In [27]:
ind[['name', 'born_city']]

                      name              born_city
80          George Caridia     Kolkata (Calcutta)
101     Algernon Kingscote  Bengaluru (Bangalore)
270            Nora Polley                 Budaun
273            Zeeshan Ali     Kolkata (Calcutta)
274         Anand Amritraj       Chennai (Madras)
...                    ...                    ...
140286       Bajrang Punia                 Khudan
140287        Deepak Punia                Jhajjar
143996         Sumit Nagal                Jhajjar
144114        Diksha Dagar                Jhajjar
144757           Arif Khan                Gulmarg

[536 rows x 2 columns]

In [29]:
new_df = pd.concat((ind, usa))
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
80,81,George Caridia,1869-02-20,Kolkata (Calcutta),West Bengal,IND,Great Britain,NaN,NaN,1937-04-21
101,102,Algernon Kingscote,1888-02-03,Bengaluru (Bangalore),Karnataka,IND,Great Britain,NaN,NaN,1964-12-21
270,271,Nora Polley,1894-07-29,Budaun,Uttar Pradesh,IND,India,NaN,NaN,1988-01-01
273,274,Zeeshan Ali,1970-01-01,Kolkata (Calcutta),West Bengal,IND,India,180.0,64.0,NaN
274,275,Anand Amritraj,1952-03-20,Chennai (Madras),Tamil Nadu,IND,India,185.0,77.0,NaN

In [33]:
combined_df = pd.merge(results, bios, on='athlete_id', how='left')

In [35]:
combined_df.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02

# Handling NULL Values

In [39]:
coffee = pd.read_csv("./warmup-data/coffee.csv")
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [48]:
import numpy as np
coffee.loc[[0,1], 'Units Sold'] = np.nan

In [42]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso         NaN
1     Monday       Latte         NaN
2    Tuesday    Espresso        30.0
3    Tuesday       Latte        20.0
4  Wednesday    Espresso        35.0

In [46]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   12 non-null     float64
dtypes: float64(1), object(2)
memory usage: 468.0+ bytes

In [ ]:
coffee.fillna(coffee['Units Sold'].mean()) # interpolate()

          Day Coffee Type  Units Sold
0      Monday    Espresso        35.0
1      Monday       Latte        35.0
2     Tuesday    Espresso        30.0
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [49]:
coffee['Units Sold'] = coffee['Units Sold'].interpolate()

In [51]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso         NaN
1     Monday       Latte         NaN
2    Tuesday    Espresso        30.0
3    Tuesday       Latte        20.0
4  Wednesday    Espresso        35.0

In [52]:
coffee.loc[[0,1], 'Units Sold'] = np.nan
coffee.dropna()

          Day Coffee Type  Units Sold
2     Tuesday    Espresso        30.0
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [ ]:
coffee[coffee['Units Sold'].isna()] # notna()

      Day Coffee Type  Units Sold
0  Monday    Espresso         NaN
1  Monday       Latte         NaN

# Aggregating data

In [54]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [55]:
bios['born_country'].value_counts()

born_country
USA        9641
GER        6891
GBR        5792
FRA        5143
ITA        4709
           ...
GIB           1
NFI           1
Munich        1
Altmark       1
Aarhus        1
Name: count, Length: 236, dtype: int64

In [56]:
bios[bios['born_country'] == 'IND']['born_city'].value_counts()

born_city
Kolkata (Calcutta)       35
Mumbai                   31
Delhi                    23
Chennai (Madras)         21
Bengaluru (Bangalore)    18
                         ..
Mangaluru (Mangalore)     1
Punwat                    1
Hisar District            1
Nilangana                 1
Gulmarg                   1
Name: count, Length: 248, dtype: int64

In [57]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    240.0
Latte       180.0
Name: Units Sold, dtype: float64

In [67]:
coffee['Price'] = np.where(coffee['Coffee Type'] == 'Espresso', 4.99, 3.99)
coffee['Revenue'] = coffee['Units Sold'] * coffee['Price']

In [68]:
coffee.groupby(['Coffee Type']).agg({'Units Sold': 'sum', 'Price': 'mean'})

             Units Sold  Price
Coffee Type
Espresso          240.0   4.99
Latte             180.0   3.99

In [69]:
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso         NaN   4.99      NaN
1      Monday       Latte         NaN   3.99      NaN
2     Tuesday    Espresso        30.0   4.99   149.70
3     Tuesday       Latte        20.0   3.99    79.80
4   Wednesday    Espresso        35.0   4.99   174.65
5   Wednesday       Latte        25.0   3.99    99.75
6    Thursday    Espresso        40.0   4.99   199.60
7    Thursday       Latte        30.0   3.99   119.70
8      Friday    Espresso        45.0   4.99   224.55
9      Friday       Latte        35.0   3.99   139.65
10   Saturday    Espresso        45.0   4.99   224.55
11   Saturday       Latte        35.0   3.99   139.65
12     Sunday    Espresso        45.0   4.99   224.55
13     Sunday       Latte        35.0   3.99   139.65

In [70]:
pivot = coffee.pivot(columns='Coffee Type', index='Day', values = 'Revenue')

In [71]:
pivot

Coffee Type  Espresso   Latte
Day
Friday         224.55  139.65
Monday            NaN     NaN
Saturday       224.55  139.65
Sunday         224.55  139.65
Thursday       199.60  119.70
Tuesday        149.70   79.80
Wednesday      174.65   99.75

In [72]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios.groupby(bios['born_date'].dt.year)['name'].count().reset_index().sort_values('name', ascending=False)

     born_date  name
139     1972.0  2231
152     1985.0  2227
140     1973.0  2216
138     1971.0  2205
137     1970.0  2174
..         ...   ...
5       1838.0     1
4       1837.0     1
3       1836.0     1
2       1833.0     1
176     2009.0     1

[177 rows x 2 columns]

# Advanced Functionality

In [74]:
coffee.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso         NaN   4.99      NaN
1     Monday       Latte         NaN   3.99      NaN
2    Tuesday    Espresso        30.0   4.99   149.70
3    Tuesday       Latte        20.0   3.99    79.80
4  Wednesday    Espresso        35.0   4.99   174.65

In [76]:
coffee['yesterday_revenue'] = coffee['Revenue'].shift(2)

In [78]:
coffee['pct_change'] = coffee['Revenue'] / coffee['yesterday_revenue'] * 100

In [81]:
coffee.head(10)

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_revenue,pct_change
0,Monday,Espresso,NaN,4.99,NaN,NaN,NaN
1,Monday,Latte,NaN,3.99,NaN,NaN,NaN
2,Tuesday,Espresso,30.0,4.99,149.70,NaN,NaN
3,Tuesday,Latte,20.0,3.99,79.80,NaN,NaN
4,Wednesday,Espresso,35.0,4.99,174.65,149.70,116.666667
5,Wednesday,Latte,25.0,3.99,99.75,79.80,125.000000
6,Thursday,Espresso,40.0,4.99,199.60,174.65,114.285714
7,Thursday,Latte,30.0,3.99,119.70,99.75,120.000000
8,Friday,Espresso,45.0,4.99,224.55,199.60,112.500000
9,Friday,Latte,35.0,3.99,139.65,119.70,116.666667

In [86]:
bios['height_rank'] = bios['height_cm'].rank(ascending=False)

In [87]:
bios.sort_values(['height_rank']).sample(10)[['name', 'height_rank']]

                        name  height_rank
107217          Aaron Myette       3949.5
108606            Ireen Wüst      83975.0
122164            Yu Eun-Hui      38677.0
43184           Einar Liberg          NaN
105314    Roberto Cammarelle       9882.0
105267  Hassan N'Dam N'Jikam      31471.5
85970       Ernst Hinterseer          NaN
65393         Aileen Meagher      83975.0
73274           Henk Keemink          NaN
62777          Mark Paterson      46966.0

In [89]:
coffee['cummulative_revenue'] = coffee['Revenue'].cumsum()

coffee.head(10)

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_revenue,pct_change,cummulative_revenue
0,Monday,Espresso,NaN,4.99,NaN,NaN,NaN,NaN
1,Monday,Latte,NaN,3.99,NaN,NaN,NaN,NaN
2,Tuesday,Espresso,30.0,4.99,149.70,NaN,NaN,149.70
3,Tuesday,Latte,20.0,3.99,79.80,NaN,NaN,229.50
4,Wednesday,Espresso,35.0,4.99,174.65,149.70,116.666667,404.15
5,Wednesday,Latte,25.0,3.99,99.75,79.80,125.000000,503.90
6,Thursday,Espresso,40.0,4.99,199.60,174.65,114.285714,703.50
7,Thursday,Latte,30.0,3.99,119.70,99.75,120.000000,823.20
8,Friday,Espresso,45.0,4.99,224.55,199.60,112.500000,1047.75
9,Friday,Latte,35.0,3.99,139.65,119.70,116.666667,1187.40

In [90]:
latte = coffee[coffee['Coffee Type'] == 'Latte'].copy()
latte['3day'] = latte['Units Sold'].rolling(3).sum()

In [91]:
latte

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_revenue,pct_change,cummulative_revenue,3day
1,Monday,Latte,NaN,3.99,NaN,NaN,NaN,NaN,NaN
3,Tuesday,Latte,20.0,3.99,79.80,NaN,NaN,229.5,NaN
5,Wednesday,Latte,25.0,3.99,99.75,79.80,125.000000,503.9,NaN
7,Thursday,Latte,30.0,3.99,119.70,99.75,120.000000,823.2,75.0
9,Friday,Latte,35.0,3.99,139.65,119.70,116.666667,1187.4,90.0
11,Saturday,Latte,35.0,3.99,139.65,139.65,100.000000,1551.6,100.0
13,Sunday,Latte,35.0,3.99,139.65,139.65,100.000000,1915.8,105.0

In [92]:
# numpy vs pyarraow

results_numpy = pd.read_csv('./data/results.csv')
results_arrow = pd.read_csv('./data/results.csv', engine='pyarrow', dtype_backend = 'pyarrow')

In [93]:
results_numpy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

In [94]:
results_arrow.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  double[pyarrow]
 1   type        305807 non-null  string[pyarrow]
 2   discipline  308407 non-null  string[pyarrow]
 3   event       308408 non-null  string[pyarrow]
 4   as          308408 non-null  string[pyarrow]
 5   athlete_id  308408 non-null  int64[pyarrow]
 6   noc         308407 non-null  string[pyarrow]
 7   team        121714 non-null  string[pyarrow]
 8   place       283193 non-null  double[pyarrow]
 9   tied        308408 non-null  bool[pyarrow]
 10  medal       44139 non-null   string[pyarrow]
dtypes: bool[pyarrow](1), double[pyarrow](2), int64[pyarrow](1), string[pyarrow](7)
memory usage: 37.5 MB